#+BEGIN_COMMENT
.. title: Deep Learning
.. slug: deep-learning
.. date: 2020-04-28 15:38:59 UTC-07:00
.. tags: deep learning
.. category: Deep Learning
.. link: 
.. description: A simple sketch of some deep learning ideas.
.. type: text
.. status: 
.. updated: 

#+END_COMMENT
#+OPTIONS: ^:{}
#+TOC: headlines 5
#+PROPERTY: header-args :session /home/athena/.local/share/jupyter/runtime/kernel-98d5ffa8-ef80-4a63-a818-cc4956f1b0be.json
#+BEGIN_SRC python :results none :exports none
%load_ext autoreload
%autoreload 2
#+END_SRC
** Train
#+begin_src python :results output :exports both
for e in range(epoch):
    total_acc = 0    
    total_loss = 0
    print('Epoch %d' % e)
    for batch_index in range(0, sub_train_images.shape[0], batch_size):
        # batch input
        if batch_index + batch_size < sub_train_images.shape[0]:
            data = sub_train_images[batch_index:batch_index+batch_size]
            label = sub_train_labels[batch_index:batch_index + batch_size]
        else:
            data = sub_train_images[batch_index:sub_train_images.shape[0]]
            label = sub_train_labels[batch_index:sub_train_labels.shape[0]]
        # Compute the remaining time
        start_time = time.time()
        batch_loss,batch_acc = net.train(data, label)  # Train the network with samples in one batch 
        
        end_time = time.time()
        batch_time = end_time-start_time
        remain_time = (sub_train_images.shape[0]-batch_index)/batch_size*batch_time
        hrs = int(remain_time/3600)
        mins = int((remain_time/60-hrs*60))
        secs = int(remain_time-mins*60-hrs*3600)
        # print('=== Iter:{0:d} === Remain: {1:d} Hrs {2:d} Mins {3:d} Secs ==='.format(int(batch_index+batch_size),int(hrs),int(mins),int(secs)))
    train_acc, train_loss = evaluate(net, sub_train_images, sub_train_labels)  # Use the evaluation code to obtain the training accuracy and loss
    test_acc, test_loss = evaluate(net, sub_test_images, sub_test_labels)      # Use the evaluation code to obtain the testing accuracy and loss
    print('=== Epoch:{0:d} Train Size:{1:d}, Train Acc:{2:.3f}, Train Loss:{3:.3f} ==='.format(e, train_size,train_acc,train_loss))

    print('=== Epoch:{0:d} Test Size:{1:d}, Test Acc:{2:.3f}, Test Loss:{3:.3f} ==='.format(e, test_size, test_acc,test_loss))
#+end_src

#+RESULTS:
#+begin_example
Epoch 0
=== Epoch:0 Train Size:2000, Train Acc:0.970, Train Loss:0.103 ===
=== Epoch:0 Test Size:400, Test Acc:0.912, Test Loss:0.301 ===
Epoch 1
=== Epoch:1 Train Size:2000, Train Acc:0.968, Train Loss:0.104 ===
=== Epoch:1 Test Size:400, Test Acc:0.912, Test Loss:0.313 ===
Epoch 2
=== Epoch:2 Train Size:2000, Train Acc:0.962, Train Loss:0.109 ===
=== Epoch:2 Test Size:400, Test Acc:0.890, Test Loss:0.330 ===
Epoch 3
=== Epoch:3 Train Size:2000, Train Acc:0.960, Train Loss:0.107 ===
=== Epoch:3 Test Size:400, Test Acc:0.895, Test Loss:0.330 ===
Epoch 4
=== Epoch:4 Train Size:2000, Train Acc:0.961, Train Loss:0.107 ===
=== Epoch:4 Test Size:400, Test Acc:0.895, Test Loss:0.343 ===
Epoch 5
=== Epoch:5 Train Size:2000, Train Acc:0.962, Train Loss:0.107 ===
=== Epoch:5 Test Size:400, Test Acc:0.897, Test Loss:0.346 ===
Epoch 6
=== Epoch:6 Train Size:2000, Train Acc:0.961, Train Loss:0.107 ===
=== Epoch:6 Test Size:400, Test Acc:0.890, Test Loss:0.363 ===
Epoch 7
=== Epoch:7 Train Size:2000, Train Acc:0.962, Train Loss:0.103 ===
=== Epoch:7 Test Size:400, Test Acc:0.892, Test Loss:0.367 ===
Epoch 8
=== Epoch:8 Train Size:2000, Train Acc:0.955, Train Loss:0.113 ===
=== Epoch:8 Test Size:400, Test Acc:0.892, Test Loss:0.397 ===
Epoch 9
=== Epoch:9 Train Size:2000, Train Acc:0.961, Train Loss:0.103 ===
=== Epoch:9 Test Size:400, Test Acc:0.892, Test Loss:0.390 ===
#+end_example

